kAMDSuccess = "Tiada ralat.";
kAMDUndefinedError = "Ralat tidak diketahui telah berlaku.";
kAMDBadHeaderError = "Fail tidak dapat dipindahkan.";
kAMDNoResourcesError = "Tidak dapat memindahkan sumber.";
kAMDReadError = "Tidak dapat dibaca dari peranti.";
kAMDWriteError = "Tidak dapat ditulis ke peranti.";
kAMDUnknownPacketError = "Paket tidak diketahui.";
kAMDInvalidArgumentError = "Perbalahan ini tidak sah.";
kAMDNotFoundError = "Fail ini tidak dapat dicari.";
kAMDIsDirectoryError = "Ini adalah direktori menurut susunan.";
kAMDPermissionError = "Anda tidak mempunyai keizinan.";
kAMDNotConnectedError = "Tidak disambungkan pada peranti.";
kAMDTimeOutError = "Operasi telah tamat waktu.";
kAMDOverrunError = "Limpahan buffer telah berlaku.";
kAMDEOFError = "Fail Tamat.";
kAMDUnsupportedError = "Operasi ini tidak disokong.";
kAMDFileExistsError = "Fail telah wujud.";
kAMDBusyError = "Peranti sedang sibuk.";
kAMDCryptoError = "Tidak dapat mewujudkan sambungan selamat ke peranti tersebut.";
kAMDTooBigError = "Mesej adalah terlalu besar.";
kAMDInvalidResponseError = "Terdapat tindak balas yang tidak dijangka pada peranti.";
kAMDMissingKeyError = "Kunci telah hilang.";
kAMDMissingValueError = "Nilai telah hilang.";
kAMDGetProhibitedError = "Tidak boleh mengambil nilai dari peranti yang dikunci kod laluan.";
kAMDSetProhibitedError = "Tidak boleh menentukan nilai pada peranti.";
kAMDRemoveProhibitedError = "Tidak boleh mengeluarkan nilai pada peranti.";
kAMDImmutableValueError = "Nilai ini tidak dapat diubah.";
kAMDPasswordProtectedError = "Peranti dilindungi kod laluan.";
kAMDMissingHostIDError = "Peranti tidak mengenali host ini.";
kAMDInvalidHostIDError = "Peranti tidak mengenali host ini.";
kAMDSessionActiveError = "Sesi ini adalah aktif.";
kAMDSessionInactiveError = "Sesi ini adalah tidak aktif.";
kAMDMissingSessionIDError = "ID sesi tidak terdapat.";
kAMDInvalidSessionIDError = "ID sesi tidak sah.";
kAMDMissingServiceError = "Perkhidmatan ini hilang.";
kAMDInvalidServiceError = "Perkhidmatan ini tidak sah.";
kAMDServiceLimitError = "Terlalu banyak contoh perkhidmatan ini sedang digunakan.";
kAMDCheckinSetupFailedError = "Perkhidmatan tidak dapat dimulakan pada peranti.";
kAMDInvalidCheckinError = "Perkhidmatan tidak dapat dimulakan pada peranti";
kAMDCheckinTimeoutError = "Perkhidmatan ini tidak dimulakan dengan betul.";
kAMDCheckinConnectionFailedError = "Perkhidmatan ini tidak dimulakan dengan betul.";
kAMDCheckinReceiveFailedError = "Perkhidmatan ini tidak dimulakan dengan betul.";
kAMDCheckinResponseFailedError = "Perkhidmatan ini tidak dimulakan dengan betul.";
kAMDCheckinOutOfMemoryError = "Perkhidmatan ini tidak dimulakan dengan betul.";
kAMDCheckinSendFailedError = "Perkhidmatan ini tidak dimulakan dengan betul.";
kAMDMissingPairRecordError = "Host tidak selaras dengan peranti.";
kAMDInvalidPairRecordError = "Host tidak lagi selaras dengan peranti.";
kAMDSavePairRecordFailedError = "Tidak dapat menyimpan rekod pasangan.";
kAMDInvalidActivationRecordError = "Rekod pengaktifan tidak sah.";
kAMDMissingActivationRecordError = "Rekod pengaktifan tidak dapat dicari.";
kAMDServiceProhibitedError = "Perkhidmatan ini tidak dapat dimulakan pada peranti ini.";
kAMDEscrowLockedError = "Peranti tidak tersedia sehingga buka kunci pertama selepas but.";
kAMDProhibitedBySupervision = "Operasi dilarang pada peranti yang diselia.";
kAMDPairingProhibitedError = "Perpasangan hanya dibenarkan melalui USB.";
kAMDWrongDroidError = "Peranti dalam keadaan pemulihan.";
kAMDSUVerificationError = "Pakej kemas kinian perisian tidak dapat ditentusahkan.";
kAMDSUPatchError = "Tidak dapat menampil fail.";
kAMDSUFirmwareError = "Firmware tidak dapat diperbaharui.";
kAMDProvisioningProfileNotValid = "Bekalan profil tidak sah.";
kAMDSendMessageError = "Tidak dapat menghantar mesej ke peranti.";
kAMDReceiveMessageError = "Tidak dapat menerima mesej dari peranti.";
kAMDMissingOptionsError = "Tiada pilihan.";
kAMDMissingImageTypeError = "Imej telah hilang.";
kAMDDigestFailedError = "Tidak dapat membaca imej disk.";
kAMDStartServiceError = "Perkhidmatan ini tidak dapat dimulakan.";
kAMDInvalidDiskImageError = "Imej disk tidak sah.";
kAMDMissingDigestError = "Digest tidak ditemui.";
kAMDMuxError = "Ralat berlaku pada multiplexor peranti USB.";
kAMDApplicationAlreadyInstalledError = "Aplikasi sistem dengan pengenalpasti berkas yang diberikan sudah dipasang pada peranti dan tidak boleh digantikan.";
kAMDApplicationMoveFailedError = "Aplikasi ini tidak dapat dipindahkan ke peranti.";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "Aplikasi ini tidak dapat melaksanakan tugas sandbox.";
kAMDApplicationVerificationFailedError = "Aplikasi ini tidak dapat disahkan.";
kAMDArchiveDestructionFailedError = "Tidak dapat memadam arkib aplikasi.";
kAMDBundleVerificationFailedError = "Berkas pembawa ini tidak dapat disahkan.";
kAMDCarrierBundleCopyFailedError = "Tidak dapat memasang berkas pembawa.";
kAMDCarrierBundleDirectoryCreationFailedError = "Tidak dapat mencipta direktori berkas pembawa.";
kAMDCarrierBundleMissingSupportedSIMsError = "Tiada SIM yang disokong untuk berkas pembawa ini.";
kAMDCommCenterNotificationFailedError = "Tidak dapat mendengar pemberitahuan dari jalur asas.";
kAMDContainerCreationFailedError = "Tidak dapat mencipta bekas aplikasi.";
kAMDContainerP0wnFailedError = "Tidak dapat membaiki keizinan pada bekas aplikasi.";
kAMDContainerRemovalFailedError = "Tidak dapat memadam bekas aplikasi.";
kAMDEmbeddedProfileInstallFailedError = "Profil peruntukkan yang dibenamkan tidak dapat dipasang.";
kAMDErrorError = "Ralat telah berlaku.";
kAMDExecutableTwiddleFailedError = "Tidak dapat menukar keizinan perlaksanaan pada aplikasi ini.";
kAMDExistenceCheckFailedError = "Tidak dapat memastikan jika aplikasi ini telah wujud atau tidak.";
kAMDInstallMapUpdateFailedError = "Tidak dapat mengemas kini senarai aplikasi yang dipasang.";
kAMDManifestCaptureFailedError = "Tidak dapat menyimpan pertunjukkan aplikasi.";
kAMDMapGenerationFailedError = "Tidak dapat menghasilkan peta.";
kAMDMissingBundleExecutableError = "Berkas aplikasi tidak mengandungi pelaksana.";
kAMDMissingBundleIdentifierError = "Berkas aplikasi tidak mengandungi pengecaman yang sah.";
kAMDMissingBundlePathError = "Tidak dapat menentukan laluan berkas aplikasi.";
kAMDMissingContainerError = "Tidak dapat mencari bekas untuk aplikasi yang dipasang.";
kAMDNotificationFailedError = "Tidak dapat menyiarkan pemberitahuan.";
kAMDPackageExtractionFailedError = "Tidak dapat membuka pakej aplikasi.";
kAMDPackageInspectionFailedError = "Tidak dapat memeriksa berkas aplikasi.";
kAMDPackageMoveFailedError = "Tidak dapat memindahkan pakej aplikasi ke dalam lokasi pementasan.";
kAMDPathConversionFailedError = "Tidak dapat menukar laluan.";
kAMDRestoreContainerFailedError = "Tidak dapat memulihkan bekas aplikasi.";
kAMDSeatbeltProfileRemovalFailedError = "Tidak dapat memadam profil seatbelt aplikasi.";
kAMDStageCreationFailedError = "Tidak dapat mencipta direktori pentas.";
kAMDSymlinkFailedError = "Tidak dapat mencipta symlink.";
kAMDiTunesArtworkCaptureFailedError = "Tidak dapat menyimpan kerja seni iTunes.";
kAMDiTunesMetadataCaptureFailedError = "Tidak dapat menyimpan metadata iTunes.";
kAMDAlreadyArchivedError = "Aplikasi ini telah wujud.";
kAMDUnknownCommandError = "Peranti tidak mengenali arahan.";
kAMDAPIInternalError = "Ralat API dalaman telah berlaku.";
kAMDMuxCreateListenerError = "Tidak dapat menemui peranti USB.";
kAMDMuxGetListenerError = "Tidak dapat mencari pendengar USB.";
kAMDMuxConnectError = "Tidak dapat disambungkan pada peranti.";
kAMDDeviceTooNewError = "Aplikasi ini perlu dikemas kini.";
kAMDDeviceRefNoGood = "Peranti ini sudah tidak disambungkan.";
kAMDDeviceDisconnectedError = "Peranti ini sudah tidak disambungkan.";
kAMDCannotTranslateError = "Tidak dapat menjemah mesej dari peranti.";
kAMDMobileImageMounterMissingImageSignature = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterResponseCreationFailed = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterMissingImageType = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterMissingImagePath = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterImageMapLoadFailed = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterAlreadyMounted = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterImageMoveFailed = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterMountPathMissing = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterMountPathNotEmpty = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterImageMountFailed = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterTrustCacheLoadFailed = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterDigestFailed = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterDigestCreationFailed = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterImageVerificationFailed = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterImageInfoCreationFailed = "Tidak dapat menyokong perkembangan.";
kAMDMobileImageMounterImageMapStoreFailed = "Tidak dapat menyokong perkembangan.";
kAMDDeviceOSVersionTooLow = "Versi OS peranti terlalu rendah.";
kAMDNoWifiSyncSupportError = "Peranti tidak menyokong penyelarasan wayarles.";
kAMDDeviceFamilyNotSupported = "Aplikasi ini tidak menyokong peranti jenis ini.";
kAMDPackagePatchFailedError = "Tidak dapat menggunakan kemas kinian tampalan pada aplikasi.";
kAMDIncorrectArchitectureError = "Aplikasi ini menyokong jenis CPU peranti ini.";
kAMDPluginCopyFailedError = "Tidak dapat menyalin Pasang Masuk VPN ke dalam bekas aplikasi.";
kAMDBreadcrumbFailedError = "Tidak dapat menulis serdak roti pemasangan.";
kAMDBreadcrumbUnlockError = "Tidak dapat mengemas kini serdak roti pemasangan.";
kAMDGeoJSONCaptureFailedError = "Tidak dapat menyimpan data GeoJSON.";
kAMDNewsstandArtworkCaptureFailedError = "Tidak dapat menyimpan kerja seni Newsstand.";
kAMDMissingCommandError = "Permintaan tidak mengandungi perintah.";
kAMDNotEntitledError = "Aplikasi yang meminta tidak dibenarkan untuk membuat permintaan ini.";
kAMDMissingPackagePathError = "Permintaan tiada laluan pakej.";
kAMDMissingContainerPathError = "Permintaan tiada laluan bekas.";
kAMDMissingApplicationIdentifierError = "Permintaan tiada pengecam aplikasi.";
kAMDMissingAttributeValueError = "Permintaan tiada nilai yang diperlukan.";
kAMDLookupFailedError = "Tidak dapat menyenaraikan aplikasi yang dipasang.";
kAMDDictCreationFailedError = "Tidak dapat mengekstrak keupayaan dari permintaan.";

/* kMISFileError */
"A file operation failed." = "Operasi telah gagal.";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "Sumber yang telah ditandatangani telah ditambah, diubah suai, atau dipadam.";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "Profil peruntukan yang sah untuk fail ini tidak ditemui.
";

/* kMISUnknownError */
"An unknown error has occurred." = "Ralat tidak diketahui telah berlaku.";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "Cuba untuk mengubah peruntukan profil abadi.";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "Aplikasi ini tidak mempunyai tanda tangan yang sah.";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "Tanda tangan aplikasi ini sah tetapi tidak berpadan dengan hash yang diharapkan.";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "Executable mengandungi tanda tangan yang tidak sah.";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "Pelaksana telah ditandatangani dengan hak yang tidak sah.";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "Identiti yang digunakan untuk menandatangani executable tidak lagi sah.";

/* kMISSignatureNotValidError */
"The signature was not valid." = "Tanda tangan tidak sah.";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "Terdapat ralat ketika berkomunikasi dengan peranti anda.";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "Profil peruntukan ini tidak boleh dipasang pada peranti ini.";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "Profil peruntukan ini tidak mempunyai tanda tangan yang sah (atau ia sah, tetapi tanda tangan tidak dipercayai).";

/* kMISExpiredError */
"This provisioning profile has expired." = "Profil peruntukan ini telah tamat tempoh.";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "Profil peruntukan ini cacat / rosak.";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "Profil peruntukan ini tidak disokong.";

/* kMISAllocationError */
"Unable to allocate memory." = "Tidak dapat menentukan memori.";

